---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.Zone.Spaces
source: html/c3e6c1c6-f009-c08c-ac71-4182c5000981.htm
---
# Autodesk.Revit.DB.Mechanical.Zone.Spaces Property

Get the Spaces of the Zone.

## Syntax (C#)
```csharp
public SpaceSet Spaces { get; }
```

## Remarks
This property is used to get the Spaces of the Zone.